name: "btcmodel"
platform: "pytorch_libtorch"
max_batch_size : 0
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ 100, 1 ]
    reshape { shape: [ 1, 100, 1 ] }
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 1 ]
    reshape { shape: [ 1 ] }
  }
]